// Question Types
// 1. MCQs | Multiple Choice | single
// 2. boolean | true/false | single
// 3. MAQs | Multiple Answers | multiple

import { Topic } from '.'

export const futureTechnology: Topic = {
  topic: 'Технологии будущего',
  level: 'Начальный',
  totalQuestions: 10,
  totalScore: 100,
  totalTime: 600,
  questions: [
    {
      question: 'Что такое искусственный интеллект?',
      choices: [
        'Набор программ для редактирования фотографий',
        'Программа для игры в шахматы',
        'Компьютерные системы, которые могут выполнять задачи, требующие интеллекта',
        'Технология для создания видео'
      ],
      type: 'MCQs',
      correctAnswers: [
        'Компьютерные системы, которые могут выполнять задачи, требующие интеллекта'
      ],
      score: 10
    },
    {
      question: 'Какую роль играет робототехника в будущем?',
      choices: [
        'Помогает автоматизировать рутинные задачи и производственные процессы',
        'Заменяет всех людей на работе',
        'Используется только в военных целях',
        'Не имеет значения для будущего'
      ],
      type: 'MCQs',
      correctAnswers: [
        'Помогает автоматизировать рутинные задачи и производственные процессы'
      ],
      score: 10
    },
    {
      question: 'Что такое виртуальная реальность (VR)?',
      choices: [
        'Способ хранения данных',
        'Тип социальных сетей',
        'Метод обучения в школах',
        'Технология, позволяющая создавать имитацию реального мира с помощью компьютера',
      ],
      type: 'MCQs',
      correctAnswers: [
        'Технология, позволяющая создавать имитацию реального мира с помощью компьютера'
      ],
      score: 10
    },
    {
      question: 'Какую технологию можно использовать для создания "умного дома"?',
      choices: [
        'Электронная почта',
        'Интернет вещей (IoT)',
        'Системы видеонаблюдения',
        'Классические выключатели'
      ],
      type: 'MCQs',
      correctAnswers: [
        'Интернет вещей (IoT)'
      ],
      score: 10
    },
    {
      question: 'Что такое 3D-печать?',
      choices: [
        'Метод рисования на компьютере',
        'Тип видеоигры',
        'Процесс создания трехмерных объектов из цифровых моделей',
        'Способ редактирования видео'
      ],
      type: 'MCQs',
      correctAnswers: [
        'Процесс создания трехмерных объектов из цифровых моделей'
      ],
      score: 10
    },
    {
      question: 'Какую из технологий будущего используют для разработки умных городов?',
      choices: [
        'Только Wi-Fi',
        'Обычные лампочки',
        'Никакие технологии не нужны',
        'Большие данные (Big Data)',
      ],
      type: 'MCQs',
      correctAnswers: [
        'Большие данные (Big Data)'
      ],
      score: 10
    },
    {
      question: 'Что такое блокчейн?',
      choices: [
        'Тип программирования',
        'Приложение для социальных сетей',
        'Технология, обеспечивающая безопасность и прозрачность транзакций',
        'Способ хранения фотографий'
      ],
      type: 'MCQs',
      correctAnswers: [
        'Технология, обеспечивающая безопасность и прозрачность транзакций'
      ],
      score: 10
    },
    {
      question: 'Какое из этих утверждений верно?',
      choices: [
        'Технологии не имеют значения для будущего',
        'Все технологии устаревают через год',
        'Технологии будущего могут изменить нашу жизнь',
        'Технологии будущего существуют только в фильмах'
      ],
      type: 'MCQs',
      correctAnswers: [
        'Технологии будущего могут изменить нашу жизнь'
      ],
      score: 10
    },
    {
      question: 'Какую технологию используют для анализа больших объемов данных?',
      choices: [
        'Машинное обучение',
        'Фотография',
        'Ручное подсчет данных',
        'Классическая бухгалтерия'
      ],
      type: 'MCQs',
      correctAnswers: [
        'Машинное обучение'
      ],
      score: 10
    },
    {
      question: 'Какой из следующих примеров является применением технологий будущего?',
      choices: [
        'Обычные машины без электроники',
        'Книги на бумаге',
        'Самоуправляемые автомобили',
        'Фотографии на пленке'
      ],
      type: 'MCQs',
      correctAnswers: [
        'Самоуправляемые автомобили'
      ],
      score: 10
    }
  ]
}


