// Question Types
// 1. MCQs | Multiple Choice | single
// 2. boolean | true/false | single
// 3. MAQs | Multiple Answers | multiple

import { Topic } from '.'

export const programmingIRL: Topic = {
  topic: 'Программирование в реальной жизни',
  level: 'Начальный',
  totalQuestions: 10,
  totalScore: 100,
  totalTime: 600,
  questions: [
    {
      question: 'Как программирование помогает в повседневной жизни?',
      choices: [
        'Создает приложения для телефонов и компьютеров',
        'Помогает в ведении хозяйства',
        'Упрощает готовку',
        'Ничем не помогает'
      ],
      type: 'MCQs',
      correctAnswers: [
        'Создает приложения для телефонов и компьютеров'
      ],
      score: 10
    },
    {
      question: 'Что из следующего является примером программы, упрощающей задачи?',
      choices: [
        'Калькулятор',
        'Книга рецептов',
        'Спортивная игра',
        'Школьный учебник'
      ],
      type: 'MCQs',
      correctAnswers: [
        'Калькулятор'
      ],
      score: 10
    },
    {
      question: 'Какую роль играет программирование в образовании?',
      choices: [
        'Не влияет на образование',
        'Создает образовательные игры и приложения',
        'Заменяет учителей',
        'Используется только для тестов'
      ],
      type: 'MCQs',
      correctAnswers: [
        'Создает образовательные игры и приложения'
      ],
      score: 10
    },
    {
      question: 'Какое из этих утверждений верно?',
      choices: [
        'Программисты пишут код для создания программ и приложений',
        'Программисты только используют готовые программы',
        'Программисты не нужны в современном мире',
        'Программисты не умеют работать с данными'
      ],
      type: 'MCQs',
      correctAnswers: [
        'Программисты пишут код для создания программ и приложений'
      ],
      score: 10
    },
    {
      question: 'Как программирование влияет на медицину?',
      choices: [
        'Не влияет',
        'Упрощает диагностику только на бумаге',
        'Используется только для создания рекламы',
        'Помогает создавать медицинские приложения и системы учета',
      ],
      type: 'MCQs',
      correctAnswers: [
        'Помогает создавать медицинские приложения и системы учета'
      ],
      score: 10
    },
    {
      question: 'Что такое "умный дом"?',
      choices: [
        'Просто красивый дом',
        'Система, использующая программирование для автоматизации функций дома',
        'Дом, построенный из умных материалов',
        'Дом с высокими потолками'
      ],
      type: 'MCQs',
      correctAnswers: [
        'Система, использующая программирование для автоматизации функций дома'
      ],
      score: 10
    },
    {
      question: 'Как программирование помогает в транспорте?',
      choices: [
        'Не влияет на транспорт',
        'Упрощает ремонт автомобилей',
        'Создает приложения для отслеживания транспорта',
        'Снижает стоимость топлива'
      ],
      type: 'MCQs',
      correctAnswers: [
        'Создает приложения для отслеживания транспорта'
      ],
      score: 10
    },
    {
      question: 'Что такое "игровое программирование"?',
      choices: [
        'Создание игр с помощью программирования',
        'Программирование только для развлечения',
        'Игра в компьютерные игры',
        'Использование игр для обучения'
      ],
      type: 'MCQs',
      correctAnswers: [
        'Создание игр с помощью программирования'
      ],
      score: 10
    },
    {
      question: 'Какое из этих приложений помогает организовать повседневные задачи?',
      choices: [
        'Книга',
        'Газета',
        'Календарь',
        'Плакат'
      ],
      type: 'MCQs',
      correctAnswers: [
        'Календарь'
      ],
      score: 10
    },
    {
      question: 'Какое из следующих утверждений верно?',
      choices: [
        'Программирование бесполезно',
        'Программирование делает жизнь проще',
        'Программирование только для профессионалов',
        'Все программы одинаковы'
      ],
      type: 'MCQs',
      correctAnswers: [
        'Программирование делает жизнь проще'
      ],
      score: 10
    }
  ]
}

